public class Сasting {
    /*Приведение к базовому типу используется для сокрытия реализации членов производного класса.
    BaseClass instance = new DerivedClass(); // Расширили //Переменная instance типа BaseClass хранит ссылку на экземпляр класса DerivedClass
    int a = 10;
    double d = a; // Неявно расширили к типу double

    UpCast - приведение экземпляра производного класса к базовому типу
    DownCase - приведение экземпляра базового типа к производному типу
    DerivedClass down = (DerivedClass) up; // Сузили
    Это сделано для сокрытия реализации. Т.е. расширили, сделали какую-то операцию, а потом опять сузили.
     */
}
